
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 3 to change, 5 to destroy.</code></pre>

* Create
  * azurerm_eventgrid_topic.mig-scan-topic[0]
  * azurerm_eventgrid_topic.mig-scanner[0]
* Update
  * azurerm_log_analytics_workspace.migration-analytics[0]
  * azurerm_recovery_services_vault.darts-migration-backup[0]
  * module.darts_redis.azurerm_redis_cache.redis
* Replace
  * module.sa.azapi_update_resource.defender_settings
  * module.sa.azurerm_storage_account.storage_account
  * module.sa-migration-standard[0].azapi_update_resource.defender_settings
  * module.sa-migration-standard[0].azurerm_private_endpoint.this[0]
  * module.sa-migration-standard[0].azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventgrid_topic.mig-scan-topic[0] will be created
  + resource "azurerm_eventgrid_topic" "mig-scan-topic" {
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + input_schema                  = "EventGridSchema"
      + local_auth_enabled            = true
      + location                      = "uksouth"
      + name                          = "mig-scan-output"
      + primary_access_key            = (sensitive value)
      + public_network_access_enabled = true
      + resource_group_name           = "darts-migration-prod-rg"
      + secondary_access_key          = (sensitive value)
    }

  # azurerm_eventgrid_topic.mig-scanner[0] will be created
  + resource "azurerm_eventgrid_topic" "mig-scanner" {
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + input_schema                  = "EventGridSchema"
      + local_auth_enabled            = true
      + location                      = "uksouth"
      + name                          = "mig-scanner"
      + primary_access_key            = (sensitive value)
      + public_network_access_enabled = true
      + resource_group_name           = "darts-migration-prod-rg"
      + secondary_access_key          = (sensitive value)
    }

  # azurerm_log_analytics_workspace.migration-analytics[0] will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "migration-analytics" {
        id                                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-analytics-workspace"
        name                                    = "darts-migration-analytics-workspace"
      ~ tags                                    = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_recovery_services_vault.darts-migration-backup[0] will be updated in-place
  ~ resource "azurerm_recovery_services_vault" "darts-migration-backup" {
        id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv"
        name                          = "darts-prod-rsv"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (7 unchanged attributes hidden)
    }

  # module.darts_redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Cache/redis/darts-prod"
        name                          = "darts-prod"
        tags                          = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          + data_persistence_authentication_method  = "SAS"
            # (11 unchanged attributes hidden)
        }
    }

  # module.sa.azapi_update_resource.defender_settings must be replaced
-/+ resource "azapi_update_resource" "defender_settings" {
      ~ id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Storage/storageAccounts/dartssaprod/providers/Microsoft.Security/DefenderForStorageSettings/current" -> (known after apply)
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
      ~ parent_id               = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Storage/storageAccounts/dartssaprod" # forces replacement -> (known after apply) # forces replacement
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Storage/storageAccounts/dartssaprod/providers/Microsoft.Security/DefenderForStorageSettings/current" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account must be replaced
-/+ resource "azurerm_storage_account" "storage_account" {
      + dns_endpoint_type                  = "Standard" # forces replacement
      ~ id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Storage/storageAccounts/dartssaprod" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
        name                               = "dartssaprod"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://dartssaprod.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "dartssaprod.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://dartssaprod.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "dartssaprod.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://dartssaprod.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "dartssaprod.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://dartssaprod.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "dartssaprod.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://dartssaprod.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "dartssaprod.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://dartssaprod.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "dartssaprod.z33.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      ~ secondary_blob_connection_string   = (sensitive value)
      ~ secondary_blob_endpoint            = "https://dartssaprod-secondary.blob.core.windows.net/" -> (known after apply)
      ~ secondary_blob_host                = "dartssaprod-secondary.blob.core.windows.net" -> (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      ~ secondary_dfs_endpoint             = "https://dartssaprod-secondary.dfs.core.windows.net/" -> (known after apply)
      ~ secondary_dfs_host                 = "dartssaprod-secondary.dfs.core.windows.net" -> (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      ~ secondary_location                 = "ukwest" -> (known after apply)
      ~ secondary_queue_endpoint           = "https://dartssaprod-secondary.queue.core.windows.net/" -> (known after apply)
      ~ secondary_queue_host               = "dartssaprod-secondary.queue.core.windows.net" -> (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      ~ secondary_table_endpoint           = "https://dartssaprod-secondary.table.core.windows.net/" -> (known after apply)
      ~ secondary_table_host               = "dartssaprod-secondary.table.core.windows.net" -> (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      ~ secondary_web_endpoint             = "https://dartssaprod-secondary.z33.web.core.windows.net/" -> (known after apply)
      ~ secondary_web_host                 = "dartssaprod-secondary.z33.web.core.windows.net" -> (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (20 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.sa-migration-standard[0].azapi_update_resource.defender_settings must be replaced
-/+ resource "azapi_update_resource" "defender_settings" {
      ~ id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02/providers/Microsoft.Security/DefenderForStorageSettings/current" -> (known after apply)
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
      ~ parent_id               = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02" # forces replacement -> (known after apply) # forces replacement
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02/providers/Microsoft.Security/DefenderForStorageSettings/current" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.sa-migration-standard[0].azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Network/privateEndpoints/saproddartsmig02" -> (known after apply)
        name                     = "saproddartsmig02"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Network/networkInterfaces/saproddartsmig02.nic.9320250c-931e-47f4-9334-3380d464117c"
              - name = "saproddartsmig02.nic.9320250c-931e-47f4-9334-3380d464117c"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Network/privateEndpoints/saproddartsmig02/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "saproddartsmig02.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.24.239.14",
                        ]
                      - name         = "saproddartsmig02"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Network/privateEndpoints/saproddartsmig02/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "saproddartsmig02"
          ~ private_connection_resource_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.24.239.14" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.sa-migration-standard[0].azurerm_storage_account.storage_account must be replaced
-/+ resource "azurerm_storage_account" "storage_account" {
      + dns_endpoint_type                  = "Standard" # forces replacement
      ~ id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
        name                               = "saproddartsmig02"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://saproddartsmig02.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "saproddartsmig02.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://saproddartsmig02.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "saproddartsmig02.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://saproddartsmig02.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "saproddartsmig02.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://saproddartsmig02.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "saproddartsmig02.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://saproddartsmig02.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "saproddartsmig02.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://saproddartsmig02.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "saproddartsmig02.z33.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (20 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 7 to add, 3 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":131,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->